//鑺傜偣淇℃伅鏌ヨ锛圛P锛屾湇鍔″晢锛屽浗瀹讹紝鏃跺尯锛岀粡绾害锛岃揣甯侊級
//geo_location_checker=http://ip-api.com/json/?fields=8450015&lang=zh-CN,https://raw.githubusercontent.com/deezertidal/QuantumultX-Rewrite/master/rewrite/ip-api.js

if ($response.statusCode != 200) {
  $done(null);
}
var city0 = "楂樿碍甯?";
var isp0 = "Cross-GFW.org";
function getRandomInt(max) {
  return Math.floor(Math.random() * Math.floor(max));
}

function City_ValidCheck(para) {
  if(para) {
  return para
  } else
  {
  return city0
//emojis[getRandomInt(emojis.length)]
  }
}

function ISP_ValidCheck(para) {
  if(para) {
  return para
  } else
  {
  return isp0
//emojis[getRandomInt(emojis.length)]
  }
}

function Area_check(para) {
  if(para=="涓崕姘戝浗"){
  return "鍙版咕"
  } else
  {
  return para
  }
}

var flags = new Map([["AC","馃嚘馃嚚"],["AD","馃嚘馃嚛"],["AE","馃嚘馃嚜"],["AF","馃嚘馃嚝"],["AG","馃嚘馃嚞"],["AI","馃嚘馃嚠"],["AL","馃嚘馃嚤"],["AM","馃嚘馃嚥"],["AO","馃嚘馃嚧"],["AQ","馃嚘馃嚩"],["AR","馃嚘馃嚪"],["AS","馃嚘馃嚫"],["AT","馃嚘馃嚬"],["AU","馃嚘馃嚭"],["AW","馃嚘馃嚰"],["AX","馃嚘馃嚱"],["AZ","馃嚘馃嚳"],["BA","馃嚙馃嚘"],["BB","馃嚙馃嚙"],["BD","馃嚙馃嚛"],["BE","馃嚙馃嚜"],["BF","馃嚙馃嚝"],["BG","馃嚙馃嚞"],["BH","馃嚙馃嚟"],["BI","馃嚙馃嚠"],["BJ","馃嚙馃嚡"],["BM","馃嚙馃嚥"],["BN","馃嚙馃嚦"],["BO","馃嚙馃嚧"],["BR","馃嚙馃嚪"],["BS","馃嚙馃嚫"],["BT","馃嚙馃嚬"],["BV","馃嚙馃嚮"],["BW","馃嚙馃嚰"],["BY","馃嚙馃嚲"],["BZ","馃嚙馃嚳"],["CA","馃嚚馃嚘"],["CD","馃嚚馃嚛"],["CF","馃嚚馃嚝"],["CG","馃嚚馃嚞"],["CH","馃嚚馃嚟"],["CI","馃嚚馃嚠"],["CK","馃嚚馃嚢"],["CL","馃嚚馃嚤"],["CM","馃嚚馃嚥"],["CN","馃嚚馃嚦"],["CO","馃嚚馃嚧"],["CP","馃嚚馃嚨"],["CR","馃嚚馃嚪"],["CU","馃嚚馃嚭"],["CV","馃嚚馃嚮"],["CW","馃嚚馃嚰"],["CX","馃嚚馃嚱"],["CY","馃嚚馃嚲"],["CZ","馃嚚馃嚳"],["DE","馃嚛馃嚜"],["DG","馃嚛馃嚞"],["DJ","馃嚛馃嚡"],["DK","馃嚛馃嚢"],["DM","馃嚛馃嚥"],["DO","馃嚛馃嚧"],["DZ","馃嚛馃嚳"],["EA","馃嚜馃嚘"],["EC","馃嚜馃嚚"],["EE","馃嚜馃嚜"],["EG","馃嚜馃嚞"],["EH","馃嚜馃嚟"],["ER","馃嚜馃嚪"],["ES","馃嚜馃嚫"],["ET","馃嚜馃嚬"],["EU","馃嚜馃嚭"],["FI","馃嚝馃嚠"],["FJ","馃嚝馃嚡"],["FK","馃嚝馃嚢"],["FM","馃嚝馃嚥"],["FO","馃嚝馃嚧"],["FR","馃嚝馃嚪"],["GA","馃嚞馃嚘"],["GB","馃嚞馃嚙"],["GD","馃嚞馃嚛"],["GE","馃嚞馃嚜"],["GF","馃嚞馃嚝"],["GH","馃嚞馃嚟"],["GI","馃嚞馃嚠"],["GL","馃嚞馃嚤"],["GM","馃嚞馃嚥"],["GN","馃嚞馃嚦"],["GP","馃嚞馃嚨"],["GR","馃嚞馃嚪"],["GT","馃嚞馃嚬"],["GU","馃嚞馃嚭"],["GW","馃嚞馃嚰"],["GY","馃嚞馃嚲"],["HK","馃嚟馃嚢"],["HN","馃嚟馃嚦"],["HR","馃嚟馃嚪"],["HT","馃嚟馃嚬"],["HU","馃嚟馃嚭"],["ID","馃嚠馃嚛"],["IE","馃嚠馃嚜"],["IL","馃嚠馃嚤"],["IM","馃嚠馃嚥"],["IN","馃嚠馃嚦"],["IR","馃嚠馃嚪"],["IS","馃嚠馃嚫"],["IT","馃嚠馃嚬"],["JM","馃嚡馃嚥"],["JO","馃嚡馃嚧"],["JP","馃嚡馃嚨"],["KE","馃嚢馃嚜"],["KG","馃嚢馃嚞"],["KH","馃嚢馃嚟"],["KI","馃嚢馃嚠"],["KM","馃嚢馃嚥"],["KN","馃嚢馃嚦"],["KP","馃嚢馃嚨"],["KR","馃嚢馃嚪"],["KW","馃嚢馃嚰"],["KY","馃嚢馃嚲"],["KZ","馃嚢馃嚳"],["LA","馃嚤馃嚘"],["LB","馃嚤馃嚙"],["LC","馃嚤馃嚚"],["LI","馃嚤馃嚠"],["LK","馃嚤馃嚢"],["LR","馃嚤馃嚪"],["LS","馃嚤馃嚫"],["LT","馃嚤馃嚬"],["LU","馃嚤馃嚭"],["LV","馃嚤馃嚮"],["LY","馃嚤馃嚲"],["MA","馃嚥馃嚘"],["MC","馃嚥馃嚚"],["MD","馃嚥馃嚛"],["MG","馃嚥馃嚞"],["MH","馃嚥馃嚟"],["MK","馃嚥馃嚢"],["ML","馃嚥馃嚤"],["MM","馃嚥馃嚥"],["MN","馃嚥馃嚦"],["MO","馃嚥馃嚧"],["MP","馃嚥馃嚨"],["MQ","馃嚥馃嚩"],["MR","馃嚥馃嚪"],["MS","馃嚥馃嚫"],["MT","馃嚥馃嚬"],["MU","馃嚥馃嚭"],["MV","馃嚥馃嚮"],["MW","馃嚥馃嚰"],["MX","馃嚥馃嚱"],["MY","馃嚥馃嚲"],["MZ","馃嚥馃嚳"],["NA","馃嚦馃嚘"],["NC","馃嚦馃嚚"],["NE","馃嚦馃嚜"],["NF","馃嚦馃嚝"],["NG","馃嚦馃嚞"],["NI","馃嚦馃嚠"],["NL","馃嚦馃嚤"],["NO","馃嚦馃嚧"],["NP","馃嚦馃嚨"],["NR","馃嚦馃嚪"],["NZ","馃嚦馃嚳"],["OM","馃嚧馃嚥"],["PA","馃嚨馃嚘"],["PE","馃嚨馃嚜"],["PF","馃嚨馃嚝"],["PG","馃嚨馃嚞"],["PH","馃嚨馃嚟"],["PK","馃嚨馃嚢"],["PL","馃嚨馃嚤"],["PM","馃嚨馃嚥"],["PR","馃嚨馃嚪"],["PS","馃嚨馃嚫"],["PT","馃嚨馃嚬"],["PW","馃嚨馃嚰"],["PY","馃嚨馃嚲"],["QA","馃嚩馃嚘"],["RE","馃嚪馃嚜"],["RO","馃嚪馃嚧"],["RS","馃嚪馃嚫"],["RU","馃嚪馃嚭"],["RW","馃嚪馃嚰"],["SA","馃嚫馃嚘"],["SB","馃嚫馃嚙"],["SC","馃嚫馃嚚"],["SD","馃嚫馃嚛"],["SE","馃嚫馃嚜"],["SG","馃嚫馃嚞"],["SI","馃嚫馃嚠"],["SK","馃嚫馃嚢"],["SL","馃嚫馃嚤"],["SM","馃嚫馃嚥"],["SN","馃嚫馃嚦"],["SR","馃嚫馃嚪"],["ST","馃嚫馃嚬"],["SV","馃嚫馃嚮"],["SY","馃嚫馃嚲"],["SZ","馃嚫馃嚳"],["TC","馃嚬馃嚚"],["TD","馃嚬馃嚛"],["TG","馃嚬馃嚞"],["TH","馃嚬馃嚟"],["TJ","馃嚬馃嚡"],["TL","馃嚬馃嚤"],["TM","馃嚬馃嚥"],["TN","馃嚬馃嚦"],["TO","馃嚬馃嚧"],["TR","馃嚬馃嚪"],["TT","馃嚬馃嚬"],["TV","馃嚬馃嚮"],["TW","馃嚚馃嚦"],["TZ","馃嚬馃嚳"],["UA","馃嚭馃嚘"],["UG","馃嚭馃嚞"],["UK","馃嚞馃嚙"],["UM","馃嚭馃嚥"],["US","馃嚭馃嚫"],["UY","馃嚭馃嚲"],["UZ","馃嚭馃嚳"],["VA","馃嚮馃嚘"],["VC","馃嚮馃嚚"],["VE","馃嚮馃嚜"],["VG","馃嚮馃嚞"],["VI","馃嚮馃嚠"],["VN","馃嚮馃嚦"],["VU","馃嚮馃嚭"],["WS","馃嚰馃嚫"],["YE","馃嚲馃嚜"],["YT","馃嚲馃嚬"],["ZA","馃嚳馃嚘"],["ZM","馃嚳馃嚥"],["ZW","馃嚳馃嚰"],["BTN","鍔墡濮?"],["INR","鍗板害鍗㈡瘮"],["CNY","浜烘皯甯佸厓"],["MOP","婢冲厓"],["HKD","娓厓"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["DKK","涓归害鍏嬫湕"],["UAH","鏍奸噷澶凹浜?"],["UZS","涔屽吂鍒厠鏂潶钀?"],["UGX","涔屽共杈惧厛浠?"],["UYI","涔屾媺鍦瘮绱?"],["UYU","涔屾媺鍦瘮绱?"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["YER","涔熼棬閲屼簹灏?"],["AMD","浜氱編灏间簹寰锋媺濮?"],["ILS","鏂拌阿鍏嬪皵"],["IQD","浼婃媺鍏嬬绾冲皵"],["IRR","浼婃湕閲屼簹灏?"],["BWP","鏅媺"],["BZD","浼埄鍏瑰厓"],["RUB","淇勭綏鏂崲甯?"],["BGN","淇濆姞鍒╀簹鍒楃摝"],["HRK","搴撶撼"],["USD","缇庡厓"],["GMD","杈炬媺瑗?"],["ISK","鍐板矝鍏嬫湕"],["GNF","鍑犲唴浜氭硶閮?"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["CHF","鐟炲＋娉曢儙"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["CDF","鍒氭灉娉曢儙"],["LYD","鍒╂瘮浜氱绾冲皵"],["LRD","鍒╂瘮閲屼簹鍏?"],["CAD","鍔犲厓"],["GHS","鍔犵撼璧涘湴"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["HUF","绂忔灄"],["USD","缇庡厓"],["SSP","鍗楄嫃涓归晳"],["ZAR","鍏扮壒"],["USD","缇庡厓"],["QAR","鍗″灏旈噷浜氬皵"],["RWF","鍗㈡椇杈炬硶閮?"],["EUR","娆у厓"],["INR","鍗板害鍗㈡瘮"],["IDR","鍗㈡瘮"],["GTQ","鏍兼煡灏?"],["USD","缇庡厓"],["ERN","绾虫硶鍏?"],["CUC","鍙厬鎹㈡瘮绱?"],["CUP","鍙ゅ反姣旂储"],["TWD","鏂板彴甯佸厓"],["KGS","绱㈠"],["DJF","鍚夊竷鎻愭硶閮?"],["KZT","鑵炬牸"],["COP","鍝ヤ鸡姣斾簹姣旂储"],["COU","鍝ヤ鸡姣斾簹UnidaddeValorReal"],["CRC","鍝ユ柉杈惧凹瀹剁鏈?"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["XDR","SDR(鐗瑰埆鎻愭鏉冿級"],["AUD","婢冲厓"],["TMT","鍦熷簱鏇兼柉鍧︽柊椹撼鐗?"],["TRY","鍦熻?冲叾閲屾媺"],["XCD","涓滃姞鍕掓瘮鍏?"],["XCD","涓滃姞鍕掓瘮鍏?"],["STN","澶氬竷鎷?"],["EUR","娆у厓"],["XCD","涓滃姞鍕掓瘮鍏?"],["EUR","娆у厓"],["AUD","婢冲厓"],["SHP","鍦ｈ但鍕掓嬁闀?"],["EUR","娆у厓"],["ANG","鑽峰睘瀹夌殑鍒楁柉鐩?"],["EUR","娆у厓"],["GYD","鍦簹閭ｅ厓"],["TZS","鍧︽灏间簹鍏堜护"],["EGP","鍩冨強闀?"],["ETB","鍩冨淇勬瘮浜氭瘮灏?"],["AUD","婢冲厓"],["TJS","绱㈡懇灏?"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["RSD","濉炲皵缁翠簹绗撼灏?"],["SLL","鍒╂槀"],["EUR","娆у厓"],["SCR","濉炶垖灏斿崲姣?"],["MXN","澧ㄨタ鍝ユ瘮绱?"],["MXV","澧ㄨタ鍝ュ熀閲戯紙UDI锛?"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["XCD","涓滃姞鍕掓瘮鍏?"],["DOP","澶氱背灏煎姞姣旂储"],["GBP","鑻遍晳"],["EUR","娆у厓"],["EUR","娆у厓"],["VEF","鐜诲埄鐡﹀皵"],["BDT","濉斿崱"],["AOA","瀹芥墡"],["XCD","涓滃姞鍕掓瘮鍏?"],["XCD","涓滃姞鍕掓瘮鍏?"],["EUR","娆у厓"],["USD","缇庡厓"],["NIO","灏煎姞鎷夌摐鏂扮澶氬反"],["NGN","濂堟媺"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["NPR","灏兼硦灏斿崲姣?"],["BSD","宸村搱椹厓"],["PKR","宸村熀鏂潶鍗㈡瘮"],["BBD","宸村反澶氭柉鍏?"],["PGK","鍩洪偅"],["PYG","鐡滄媺灏?"],["PAB","宸存尝浜?"],["USD","缇庡厓"],["BHD","宸存灄绗撼灏?"],["BRL","宸磋タ闆蜂簹灏?"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["NOK","鎸▉鍏嬫湕"],["BIF","甯冮殕杩硶閮?"],["EUR","娆у厓"],["USD","缇庡厓"],["USD","缇庡厓"],["NZD","鏂拌タ鍏板厓"],["ANG","鑽峰睘瀹夌殑鍒楁柉鐩?"],["KYD","寮?鏇肩兢宀涘厓"],["EUR","娆у厓"],["EUR","娆у厓"],["SBD","鎵?缃楅棬缇ゅ矝鍏?"],["NZD","鏂拌タ鍏板厓"],["EUR","娆у厓"],["NOK","鎸▉鍏嬫湕"],["CZK","鎹峰厠鍏嬫湕"],["MDL","鎽╁皵澶氱摝灏间箤"],["MAD","鎽╂礇鍝ヨ开鎷夊"],["EUR","娆у厓"],["BND","鏂囪幈鍏?"],["FJD","鏂愭祹鍏?"],["SZL","閲屽叞鍩哄凹"],["EUR","娆у厓"],["EUR","娆у厓"],["NOK","鎸▉鍏嬫湕"],["LKR","鏂噷鍏板崱鍗㈡瘮"],["SGD","鏂板姞鍧″厓"],["XPF","闈炴床閲戣瀺鍏卞悓浣撴硶閮?"],["NZD","鏂拌タ鍏板厓"],["JPY","鏃ュ厓"],["CLF","鏅哄埄璧勯噾"],["CLP","鏅哄埄姣旂储"],["KPW","鏈濋矞鍦?"],["KHR","鐟炲皵"],["GBP","鑻遍晳"],["XCD","涓滃姞鍕掓瘮鍏?"],["DKK","涓归害鍏嬫湕"],["GEL","鎷夐噷"],["EUR","娆у厓"],["EUR","娆у厓"],["EUR","娆у厓"],["MRU","涔屽悏浜?"],["MUR","姣涢噷姹傛柉鍗㈡瘮"],["TOP","娼樺姞鈥?"],["SAR","娌欑壒閲屼簹灏?"],["EUR","娆у厓"],["EUR","娆у厓"],["EUR","娆у厓"],["XPF","闈炴床閲戣瀺鍏卞悓浣撴硶閮?"],["DKK","涓归害鍏嬫湕"],["PLN","鍏圭綏鎻?"],["USD","缇庡厓"],["BAM","鍙厬鎹㈤┈鍏?"],["THB","娉伴摙"],["GBP","鑻遍晳"],["ZWL","娲ュ反甯冮煢鍏?"],["HNL","浼︾毊鎷?"],["HTG","鍙ゅ痉"],["USD","缇庡厓"],["AUD","婢冲厓"],["EUR","娆у厓"],["EUR","娆у厓"],["JMD","鐗欎拱鍔犲厓"],["USD","缇庡厓"],["TTD","鐗圭珛杈句笌澶氬反鍝ュ厓"],["BOB","鐜诲埄缁翠簹璇?"],["BOV","鐜诲埄缁翠簹璧勯噾"],["AUD","婢冲厓"],["SEK","鐟炲吀鍏嬫湕"],["CHE","WIR娆у厓"],["CHF","鐟炲＋娉曢儙"],["CHW","WIR娉曢儙"],["EUR","娆у厓"],["XPF","闈炴床閲戣瀺鍏卞悓浣撴硶閮?"],["VUV","鐡﹀浘"],["EUR","娆у厓"],["BYR","鐧戒縿缃楁柉鍗㈠竷"],["BMD","鐧炬厱澶у厓"],["NZD","鏂拌タ鍏板厓"],["GIP","鐩村竷缃楅檧闀?"],["FKP","绂忓厠鍏扮兢宀涢晳"],["AUD","婢冲厓"],["KWD","绉戝▉鐗圭绾冲皵"],["KMF","绉戞懇缃楁硶閮?"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["PEN","鏂扮储灏?"],["TND","绐佸凹鏂绾冲皵"],["EUR","娆у厓"],["SOS","绱㈤┈閲屽厛浠?"],["JOD","绾︽棪绗撼灏?"],["NAD","绾崇背姣斾簹鍏?"],["ZAR","鍏扮壒"],["NZD","鏂拌タ鍏板厓"],["CVE","浣涘緱瑙掑焹鏂簱澶?"],["MMK","缂呯敻鍏?"],["RON","缃楅┈灏间簹鍒椾紛"],["USD","缇庡厓"],["USN","缇庡厓锛堟鏃ワ級"],["USD","缇庡厓"],["USD","缇庡厓USDollar"],["USD","缇庡厓"],["LAK","鍩烘櫘"],["KES","鑲凹浜氬厛浠?"],["EUR","娆у厓"],["SDG","鑻忎腹闀?"],["SRD","鑻忛噷鍗楀厓"],["GBP","鑻遍晳"],["USD","缇庡厓"],["USD","缇庡厓"],["EUR","娆у厓"],["MZN","鑾姣斿厠姊呰拏鍗″皵"],["LSL","椴佹"],["ZAR","鍏扮壒"],["PHP","鑿插緥瀹炬瘮绱?"],["SVC","钀ㄥ皵鐡﹀绉戞湕"],["USD","缇庡厓"],["WST","濉旀媺"],["EUR","娆у厓"],["MNT","鍥炬牸閲屽厠"],["XCD","涓滃姞鍕掓瘮鍏?"],["MAD","鎽╂礇鍝ヨ开绾冲"],["EUR","娆у厓"],["AUD","婢冲厓"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["ZMW","璧炴瘮浜氬厠鐡︽煡"],["XAF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["AUD","婢冲厓"],["VND","瓒婂崡鐩?"],["AZN","闃垮鎷滅枂椹撼鐗?"],["AFN","闃垮凹"],["DZD","闃垮皵鍙婂埄浜氱绾冲皵"],["ALL","鍒楀厠"],["SYP","鍙欏埄浜氶晳"],["AED","闃胯仈閰嬭开鎷夊"],["OMR","闃挎浖閲屼簹灏?"],["ARS","闃挎牴寤锋瘮绱?"],["AWG","闃块瞾宸村紬娲涙灄"],["XUA","闈炴床鍙戝睍閾惰璐︽埛鍗曚綅"],["KRW","闊╁厓"],["MKD","绗撼灏?"],["MVR","鎷夎彶浜?"],["MWK","鍏嬬摝鏌?"],["EUR","娆у厓"],["MYR","椹潵瑗夸簹鏋楀悏鐗?"],["EUR","娆у厓"],["USD","缇庡厓"],["EUR","娆у厓"],["MGA","闃块噷浜氶噷"],["XOF","澶氬摜闈炴床鍏卞悓浣撴硶閮?"],["LBP","榛庡反瀚╅晳"],["EUR","娆у厓"]])

var body = $response.body;
var obj = JSON.parse(body);
var title =flags.get(obj['countryCode']) +Area_check(obj['country'])+"   "+obj['city'];
var subtitle = obj['as'];
var ip = obj['query']+flags.get(obj['countryCode']);
var description = '------------------------------'+'\n'+'\n'+'馃枼锔忔湇鍔″晢:'+obj['isp'] + '\n'+'\n'+'馃實鍦板尯:' +City_ValidCheck(obj['regionName'])+ '\n'+ '\n' + '馃椇锔廔P鍦板潃:'+ obj['query'] + flags.get(obj['countryCode']) +'\n'+ '\n' +'馃晽鏃跺尯:'+ obj['timezone']+'\n'+'\n'+'馃搷缁忕含搴︼細'+obj['lon']+ ','+obj['lat']+'\n' +'\n'+'馃獧璐у竵:'+ obj['currency'] +flags.get(obj['currency']);
$done({title, subtitle,ip, description});
